{
  "recipes": [
    {
      "title": "Folate-Rich Lentil and Spinach Soup",
      "description": "A nourishing, iron and folate-packed soup perfect for supporting pregnancy nutrition. This comforting one-pot meal is easy to digest and can be made in large batches for the week ahead.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["dairy-free", "nut-free", "vegetarian", "vegan", "egg-free"],
      "kitchen_style_tags": ["batch"],
      "meal_types": ["lunch", "dinner"],
      "cuisine": "mediterranean",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "red lentils", "amount": "1.5 cups"},
        {"item": "fresh spinach", "amount": "4 cups"},
        {"item": "diced tomatoes", "amount": "1 can (14 oz)"},
        {"item": "vegetable broth", "amount": "6 cups"},
        {"item": "onion, diced", "amount": "1 medium"},
        {"item": "garlic, minced", "amount": "3 cloves"},
        {"item": "cumin", "amount": "1 tsp"},
        {"item": "olive oil", "amount": "2 tbsp"},
        {"item": "lemon juice", "amount": "2 tbsp"},
        {"item": "salt and pepper", "amount": "to taste"}
      ],
      "instructions": [
        "Heat 2 tablespoons olive oil in a large 6-quart pot over medium heat (about 350°F if using an electric stove) for 1-2 minutes until shimmering.",
        "Add diced onion and cook for 5-6 minutes, stirring occasionally, until softened and translucent but not browned.",
        "Add minced garlic and cumin, stirring constantly for 1 minute until fragrant (be careful not to burn the garlic).",
        "Pour in the vegetable broth, diced tomatoes with their juices, and rinsed red lentils. Stir well to combine all ingredients.",
        "Increase heat to high and bring mixture to a rolling boil (you'll see large bubbles breaking the surface).",
        "Once boiling, reduce heat to medium-low to maintain a gentle simmer. Cover pot partially with lid.",
        "Simmer for 20-25 minutes, stirring occasionally, until lentils are completely tender and beginning to break down (they should mash easily against the side of the pot).",
        "Add fresh spinach in batches, stirring after each addition until wilted (this takes about 2-3 minutes total).",
        "Remove from heat and stir in lemon juice, salt, and pepper to taste. Let stand 2-3 minutes before serving.",
        "Serve warm in bowls. Can be enjoyed as-is or with whole grain bread on the side."
      ],
      "tips": ["Make a double batch and freeze individual portions in freezer-safe containers for easy meals during busy weeks", "The lemon juice is added at the end to preserve vitamin C content and bright flavor", "If soup thickens too much when stored, add a splash of broth or water when reheating"],
      "time_minutes": 35,
      "difficulty": "easy",
      "servings": 6,
      "calories": 210,
      "allergens": [],
      "storage": "Refrigerate in airtight container for up to 5 days. Freeze in portion-sized containers for up to 3 months. Thaw overnight in refrigerator and reheat on stovetop over medium heat."
    },
    {
      "title": "Greek Yogurt Parfait with Berries and Almonds",
      "description": "A protein-rich breakfast loaded with calcium, probiotics, and antioxidants to support both mom and baby. Quick to assemble and satisfying enough to keep morning nausea at bay.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["gluten-free", "vegetarian"],
      "kitchen_style_tags": ["quick"],
      "meal_types": ["breakfast", "snack"],
      "cuisine": "mediterranean",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "plain Greek yogurt", "amount": "2 cups"},
        {"item": "fresh blueberries", "amount": "1 cup"},
        {"item": "fresh strawberries, sliced", "amount": "1 cup"},
        {"item": "sliced almonds", "amount": "1/4 cup"},
        {"item": "honey", "amount": "2 tbsp"},
        {"item": "chia seeds", "amount": "2 tbsp"},
        {"item": "granola", "amount": "1/2 cup"}
      ],
      "instructions": [
        "Remove Greek yogurt from refrigerator and stir well in the container to ensure smooth, creamy consistency.",
        "Rinse blueberries under cold water and pat dry with paper towels. Hull and slice strawberries into 1/4-inch thick pieces.",
        "Take 2 clear glasses or medium bowls. Spoon 1/4 cup of Greek yogurt into the bottom of each glass, spreading evenly.",
        "Add 1/4 cup mixed berries on top of the yogurt layer in each glass, distributing blueberries and strawberries evenly.",
        "Sprinkle 1/2 tablespoon chia seeds and 1 tablespoon sliced almonds over the berry layer in each glass.",
        "Add another 1/4 cup layer of Greek yogurt to each glass, smoothing the top with the back of a spoon.",
        "Top with remaining berries (about 1/4 cup per glass), arranging them attractively.",
        "Just before serving, sprinkle 1/4 cup granola on top of each parfait for crunch.",
        "Drizzle 1 tablespoon honey over each parfait in a zigzag pattern.",
        "Serve immediately with a long spoon for easy layering access."
      ],
      "tips": ["Prep all ingredients the night before and store separately - assemble in the morning for fresh texture", "Choose full-fat Greek yogurt for better absorption of fat-soluble vitamins", "If experiencing morning nausea, keep parfait cold and eat slowly in small spoonfuls"],
      "time_minutes": 10,
      "difficulty": "easy",
      "servings": 2,
      "calories": 380,
      "allergens": ["milk", "tree_nuts"],
      "storage": "Best consumed fresh. Can refrigerate assembled parfait (without granola) for up to 4 hours. Add granola just before eating to prevent sogginess. Store components separately for up to 3 days."
    },
    {
      "title": "Salmon and Sweet Potato Bowl with Avocado",
      "description": "An omega-3 powerhouse meal that supports baby's brain development with wild-caught salmon and nutrient-dense sweet potatoes. This colorful bowl provides healthy fats, protein, and complex carbohydrates in one satisfying dish.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["dairy-free", "gluten-free", "nut-free", "egg-free"],
      "kitchen_style_tags": [],
      "meal_types": ["lunch", "dinner"],
      "cuisine": "american",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "wild salmon fillets", "amount": "12 oz"},
        {"item": "sweet potatoes, cubed", "amount": "2 medium"},
        {"item": "avocado, sliced", "amount": "1 large"},
        {"item": "baby kale", "amount": "2 cups"},
        {"item": "olive oil", "amount": "3 tbsp"},
        {"item": "lemon", "amount": "1"},
        {"item": "garlic powder", "amount": "1 tsp"},
        {"item": "paprika", "amount": "1/2 tsp"},
        {"item": "salt and pepper", "amount": "to taste"}
      ],
      "instructions": [
        "Preheat oven to 400°F (200°C). Line a large baking sheet with parchment paper.",
        "Peel sweet potatoes and cut into 3/4-inch cubes (uniform size ensures even cooking).",
        "Place sweet potato cubes in a medium bowl, drizzle with 1 tablespoon olive oil, and toss with 1/4 teaspoon salt and pepper until evenly coated.",
        "Spread sweet potato cubes in a single layer on prepared baking sheet, ensuring they don't touch (crowding causes steaming instead of roasting).",
        "Roast for 25-30 minutes, flipping halfway through with a spatula, until golden brown on edges and easily pierced with a fork.",
        "While sweet potatoes roast, pat salmon fillets dry with paper towels. Season both sides with garlic powder, paprika, 1/4 teaspoon salt, and pepper.",
        "Heat 1 tablespoon olive oil in a 10-inch skillet over medium-high heat for 2 minutes until oil shimmers.",
        "Place salmon fillets skin-side down in the hot skillet. Cook without moving for 4-5 minutes until skin is crispy and fish releases easily from pan.",
        "Carefully flip salmon using a wide spatula. Cook for another 3-4 minutes until internal temperature reaches 145°F and flesh flakes easily with a fork but is still moist in center.",
        "Remove salmon from heat and let rest for 2 minutes. Meanwhile, place baby kale in a large bowl.",
        "Drizzle kale with remaining 1 tablespoon olive oil and juice of half the lemon. Massage kale with clean hands for 30-45 seconds until leaves soften and darken in color.",
        "Slice avocado in half, remove pit, and cut flesh into thin slices while still in the skin, then scoop out with a spoon.",
        "Divide massaged kale among 3 serving bowls. Top each with roasted sweet potatoes, a salmon fillet, and avocado slices.",
        "Cut remaining lemon half into wedges and serve alongside bowls for squeezing over top."
      ],
      "tips": ["Choose wild-caught salmon over farmed for higher omega-3 content and lower mercury levels", "Cook extra salmon to flake into salads or grain bowls throughout the week", "If salmon skin sticks to pan, it's not ready to flip - give it another minute"],
      "time_minutes": 40,
      "difficulty": "medium",
      "servings": 3,
      "calories": 425,
      "allergens": ["fish"],
      "storage": "Refrigerate components separately in airtight containers for up to 3 days. Store avocado with lemon juice to prevent browning. Assemble fresh when ready to eat. Reheat salmon and sweet potatoes in oven at 350°F for 8-10 minutes."
    },
    {
      "title": "Quinoa and Black Bean Burrito Bowl",
      "description": "A protein and fiber-packed Mexican-inspired bowl that helps prevent pregnancy constipation while satisfying cravings. Complete with plant-based protein, folate-rich beans, and satisfying whole grains.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["dairy-free", "gluten-free", "nut-free", "vegetarian", "vegan", "egg-free"],
      "kitchen_style_tags": ["batch"],
      "meal_types": ["lunch", "dinner"],
      "cuisine": "mexican",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "quinoa, uncooked", "amount": "1 cup"},
        {"item": "water", "amount": "2 cups"},
        {"item": "black beans, cooked or canned", "amount": "2 cups"},
        {"item": "bell peppers, diced", "amount": "2"},
        {"item": "corn kernels, fresh or frozen", "amount": "1 cup"},
        {"item": "cherry tomatoes, halved", "amount": "1 cup"},
        {"item": "red onion, diced", "amount": "1/2"},
        {"item": "limes", "amount": "2"},
        {"item": "fresh cilantro, chopped", "amount": "1/4 cup"},
        {"item": "cumin", "amount": "1 tsp"},
        {"item": "olive oil", "amount": "2 tbsp"},
        {"item": "salt and pepper", "amount": "to taste"}
      ],
      "instructions": [
        "Rinse 1 cup quinoa in a fine-mesh strainer under cold running water for 30 seconds, rubbing grains between your fingers (this removes bitter coating).",
        "In a medium saucepan, combine rinsed quinoa and 2 cups water. Bring to a boil over high heat (about 5 minutes).",
        "Once boiling, reduce heat to low, cover with tight-fitting lid, and simmer for 15 minutes without lifting lid.",
        "After 15 minutes, remove from heat and let stand covered for 5 minutes. Then fluff quinoa with a fork - grains should be tender with a slight pop and all water absorbed.",
        "If using canned black beans, drain and rinse under cold water for 30 seconds. If using cooked beans, measure out 2 cups.",
        "Heat 2 tablespoons olive oil in a large 12-inch skillet over medium heat for 1-2 minutes until shimmering.",
        "Add diced bell peppers and red onion to skillet. Sauté for 5-6 minutes, stirring every minute, until vegetables are softened and peppers have some charred spots.",
        "Add black beans, corn kernels, and 1 teaspoon cumin to the skillet. Stir well and cook for 3-4 minutes until beans are heated through (internal temperature should reach 165°F).",
        "Squeeze juice from 1 lime over the bean mixture (about 2 tablespoons). Season with 1/2 teaspoon salt and 1/4 teaspoon black pepper. Stir and taste, adjusting seasoning as needed.",
        "Remove skillet from heat. Halve cherry tomatoes and chop fresh cilantro.",
        "To assemble bowls: Divide cooked quinoa among 4 serving bowls (about 3/4 cup per bowl).",
        "Top each bowl with equal portions of the black bean and vegetable mixture (about 3/4 cup per bowl).",
        "Garnish each bowl with cherry tomato halves and chopped cilantro.",
        "Cut remaining lime into 4 wedges and place one on the side of each bowl for squeezing over top before eating."
      ],
      "tips": ["Batch cook quinoa and beans on Sunday for quick weekday assembly throughout the week", "Add optional toppings like diced avocado, pumpkin seeds, or a dollop of Greek yogurt for extra nutrients", "This bowl tastes great cold, making it perfect for meal prep lunches"],
      "time_minutes": 30,
      "difficulty": "easy",
      "servings": 4,
      "calories": 340,
      "allergens": [],
      "storage": "Refrigerate in airtight container for up to 4 days. Can be eaten cold or reheated in microwave for 1-2 minutes until warmed through. Store lime wedges separately and add fresh cilantro when serving."
    },
    {
      "title": "Spinach and Feta Egg Muffins",
      "description": "Protein-rich portable breakfast muffins perfect for busy mornings or combating first-trimester nausea. These make-ahead egg cups are loaded with iron, folate, and can be eaten at room temperature.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["gluten-free", "nut-free", "vegetarian"],
      "kitchen_style_tags": ["batch", "quick"],
      "meal_types": ["breakfast", "snack"],
      "cuisine": "american",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "large eggs", "amount": "10"},
        {"item": "fresh spinach, chopped", "amount": "2 cups"},
        {"item": "feta cheese, crumbled", "amount": "1/2 cup"},
        {"item": "cherry tomatoes, quartered", "amount": "1 cup"},
        {"item": "milk", "amount": "1/4 cup"},
        {"item": "onion powder", "amount": "1/2 tsp"},
        {"item": "garlic powder", "amount": "1/2 tsp"},
        {"item": "salt and pepper", "amount": "to taste"},
        {"item": "olive oil cooking spray", "amount": "for muffin tin"}
      ],
      "instructions": [
        "Preheat oven to 350°F (175°C). Position rack in center of oven.",
        "Generously spray a 12-cup standard muffin tin with olive oil cooking spray, making sure to coat bottom and sides of each cup to prevent sticking.",
        "Rinse fresh spinach and pat completely dry with paper towels or spin in salad spinner. Roughly chop into 1/2-inch pieces.",
        "Quarter cherry tomatoes and set aside. Crumble feta cheese if using a block.",
        "Crack 10 eggs into a large mixing bowl. Add 1/4 cup milk, 1/2 teaspoon onion powder, 1/2 teaspoon garlic powder, 1/4 teaspoon salt, and 1/8 teaspoon black pepper.",
        "Whisk mixture vigorously for 30-45 seconds until eggs are completely broken up, well combined, and slightly frothy.",
        "Add chopped spinach, crumbled feta cheese, and quartered cherry tomatoes to the egg mixture. Stir gently with a spoon until vegetables and cheese are evenly distributed.",
        "Using a 1/4-cup measuring cup or ladle, divide egg mixture evenly among the 12 muffin cups, filling each about 3/4 full (leave room for rising).",
        "Gently tap muffin tin on counter once to release any air bubbles.",
        "Carefully place muffin tin in preheated oven. Bake for 20-22 minutes until eggs are fully set in the center (no jiggle when gently shaken) and tops are lightly golden brown.",
        "Insert a toothpick into the center of one muffin - it should come out clean when done.",
        "Remove from oven and let cool in the tin for 5 minutes (this makes removal easier).",
        "Run a butter knife around the edge of each muffin cup to loosen. Carefully lift out each muffin with a spoon or small spatula.",
        "Serve warm or let cool to room temperature. Can be enjoyed immediately or stored for later use."
      ],
      "tips": ["Make a double batch on Sunday and freeze individually wrapped in plastic wrap then placed in a freezer bag for grab-and-go breakfasts", "These are perfect for eating cold when morning sickness makes hot foods unappealing", "Customize with your favorite vegetables like diced bell peppers, mushrooms, or zucchini"],
      "time_minutes": 30,
      "difficulty": "easy",
      "servings": 12,
      "calories": 95,
      "allergens": ["eggs", "milk"],
      "storage": "Refrigerate in airtight container for up to 5 days. Freeze individually wrapped in plastic wrap then in freezer bag for up to 2 months. Thaw overnight in refrigerator or microwave for 30-45 seconds until warmed through."
    },
    {
      "title": "Chicken and Vegetable Stir-Fry with Brown Rice",
      "description": "A quick, iron and vitamin-rich Asian-inspired dinner that comes together in under 30 minutes. Packed with lean protein and colorful vegetables to support a healthy pregnancy.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["dairy-free", "nut-free", "egg-free"],
      "kitchen_style_tags": ["quick"],
      "meal_types": ["dinner"],
      "cuisine": "asian",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "boneless skinless chicken breast, sliced", "amount": "1 lb"},
        {"item": "broccoli florets", "amount": "2 cups"},
        {"item": "snap peas", "amount": "1 cup"},
        {"item": "carrots, julienned", "amount": "1 cup"},
        {"item": "bell pepper, sliced", "amount": "1"},
        {"item": "brown rice, cooked", "amount": "3 cups"},
        {"item": "low-sodium soy sauce", "amount": "3 tbsp"},
        {"item": "fresh ginger, minced", "amount": "1 tbsp"},
        {"item": "garlic cloves, minced", "amount": "3"},
        {"item": "sesame oil", "amount": "2 tbsp"},
        {"item": "cornstarch", "amount": "1 tsp"},
        {"item": "water", "amount": "2 tbsp"}
      ],
      "instructions": [
        "In a small bowl, whisk together 3 tablespoons low-sodium soy sauce, 1 teaspoon cornstarch, and 2 tablespoons water until cornstarch is completely dissolved with no lumps. Set aside.",
        "Slice chicken breast against the grain into thin strips about 1/4-inch thick and 2 inches long for quick, even cooking.",
        "Cut broccoli into small florets (about 1-inch pieces). Slice bell pepper into thin strips. Julienne carrots into matchstick-sized pieces.",
        "Heat 1 tablespoon sesame oil in a large 14-inch wok or deep skillet over high heat for 1-2 minutes until oil is shimmering and almost smoking.",
        "Add sliced chicken in a single layer. Cook without stirring for 2 minutes to get a golden sear on one side.",
        "Stir-fry chicken, tossing every 30 seconds, for 3-4 more minutes total until chicken is golden brown on outside and cooked through (internal temperature 165°F). Remove chicken to a plate and set aside.",
        "Add remaining 1 tablespoon sesame oil to the same wok. Add broccoli florets, julienned carrots, and snap peas.",
        "Stir-fry vegetables over high heat for 4 minutes, tossing every 30-45 seconds, until vegetables are crisp-tender and broccoli has some charred spots.",
        "Add sliced bell pepper, minced ginger, and minced garlic. Stir-fry for 2 minutes, stirring constantly to prevent garlic from burning.",
        "Return cooked chicken and any accumulated juices to the wok with vegetables. Toss to combine.",
        "Give the soy sauce mixture a quick stir to recombine, then pour over the chicken and vegetables.",
        "Toss everything together constantly for 1 minute until sauce thickens, becomes glossy, and evenly coats all ingredients (sauce should cling to food, not pool at bottom).",
        "Taste and adjust seasoning if needed. Remove from heat immediately to prevent overcooking.",
        "Divide cooked brown rice among 4 serving plates or bowls (about 3/4 cup per serving). Top each with equal portions of stir-fry.",
        "Serve immediately while hot."
      ],
      "tips": ["Use pre-cut vegetables from the grocery store to save even more prep time", "Have all ingredients prepped and ready before you start cooking - stir-frying moves quickly", "Double the recipe and pack leftovers for easy next-day lunches"],
      "time_minutes": 25,
      "difficulty": "easy",
      "servings": 4,
      "calories": 385,
      "allergens": ["soy", "sesame"],
      "storage": "Refrigerate in airtight container for up to 3 days. Store rice separately for best texture. Reheat in microwave for 2-3 minutes or in skillet over medium heat for 5 minutes until heated through to 165°F."
    },
    {
      "title": "Overnight Oats with Chia and Berries",
      "description": "A no-cook breakfast solution packed with fiber, omega-3s, and slow-release energy to prevent morning blood sugar crashes. Perfect for those difficult first-trimester mornings when cooking feels impossible.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["vegetarian"],
      "kitchen_style_tags": ["quick", "batch"],
      "meal_types": ["breakfast"],
      "cuisine": "american",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "rolled oats", "amount": "2 cups"},
        {"item": "milk or unsweetened almond milk", "amount": "2 cups"},
        {"item": "plain Greek yogurt", "amount": "1/2 cup"},
        {"item": "chia seeds", "amount": "4 tbsp"},
        {"item": "honey or maple syrup", "amount": "3 tbsp"},
        {"item": "vanilla extract", "amount": "1 tsp"},
        {"item": "fresh or frozen berries", "amount": "1.5 cups"},
        {"item": "sliced almonds", "amount": "1/4 cup"},
        {"item": "ground cinnamon", "amount": "1/2 tsp"}
      ],
      "instructions": [
        "In a large mixing bowl, combine 2 cups rolled oats, 2 cups milk, 1/2 cup Greek yogurt, 4 tablespoons chia seeds, 3 tablespoons honey, 1 teaspoon vanilla extract, and 1/2 teaspoon ground cinnamon.",
        "Whisk mixture vigorously for 30-45 seconds until all ingredients are thoroughly combined and yogurt is fully incorporated with no lumps remaining.",
        "Prepare 4 mason jars (16-ounce size) or airtight containers with lids. If using frozen berries, thaw and drain excess liquid.",
        "Divide the oat mixture evenly among the 4 containers, pouring about 3/4 cup into each (leave room at top for berries and toppings).",
        "Add approximately 1/3 cup mixed berries to the top of each container, pressing them gently into the oat mixture.",
        "Seal each container tightly with its lid. Give each jar a gentle shake to settle contents.",
        "Refrigerate jars for at least 4 hours or preferably overnight (8-12 hours) - this allows oats to fully absorb liquid and chia seeds to create creamy texture.",
        "In the morning, remove jar from refrigerator. The oats should be thick, creamy, and fully hydrated (not crunchy).",
        "Open jar and stir contents well with a spoon, mixing the berries throughout.",
        "Top each portion with 1 tablespoon sliced almonds just before eating for fresh crunch.",
        "Enjoy cold straight from the jar, or warm in microwave for 30-45 seconds if preferred (stir halfway through heating)."
      ],
      "tips": ["Prep 4-5 jars on Sunday evening for grab-and-go breakfasts all week", "Can be eaten straight from the fridge when nausea makes hot food unappealing", "Customize with different fruits like sliced banana, diced apple, or mango for variety throughout the week"],
      "time_minutes": 10,
      "difficulty": "easy",
      "servings": 4,
      "calories": 320,
      "allergens": ["milk", "tree_nuts"],
      "storage": "Refrigerate in sealed containers for up to 5 days. Not suitable for freezing due to texture changes. Add fresh toppings like almonds just before eating for best texture."
    },
    {
      "title": "Lentil and Vegetable Curry with Coconut Milk",
      "description": "A warming, anti-inflammatory curry rich in plant-based protein, iron, and folate to support pregnancy health. This flavorful one-pot meal is gentle on digestion and can be customized to preferred spice levels.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["dairy-free", "gluten-free", "nut-free", "vegetarian", "vegan", "egg-free"],
      "kitchen_style_tags": ["batch"],
      "meal_types": ["dinner"],
      "cuisine": "indian",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "red lentils", "amount": "1.5 cups"},
        {"item": "coconut milk", "amount": "1 can (14 oz)"},
        {"item": "cauliflower florets", "amount": "2 cups"},
        {"item": "sweet potato, cubed", "amount": "1 large"},
        {"item": "diced tomatoes", "amount": "1 can (14 oz)"},
        {"item": "vegetable broth", "amount": "2 cups"},
        {"item": "onion, diced", "amount": "1 medium"},
        {"item": "garlic cloves, minced", "amount": "4"},
        {"item": "curry powder", "amount": "2 tbsp"},
        {"item": "turmeric", "amount": "1 tsp"},
        {"item": "olive oil", "amount": "2 tbsp"},
        {"item": "fresh spinach", "amount": "2 cups"},
        {"item": "salt and pepper", "amount": "to taste"}
      ],
      "instructions": [
        "Peel sweet potato and cut into 3/4-inch cubes. Cut cauliflower into small florets (about 1-inch pieces). Rinse red lentils in fine-mesh strainer under cold water for 30 seconds.",
        "Heat 2 tablespoons olive oil in a large 6-quart pot or Dutch oven over medium heat for 1-2 minutes until shimmering.",
        "Add diced onion and cook for 5-6 minutes, stirring occasionally, until softened and translucent with lightly golden edges.",
        "Add minced garlic, 2 tablespoons curry powder, and 1 teaspoon turmeric to the pot. Stir constantly for 1 minute until spices are fragrant and coat the onions (be careful not to burn).",
        "Add sweet potato cubes, cauliflower florets, rinsed lentils, diced tomatoes with their juices, and 2 cups vegetable broth. Stir well to combine all ingredients and coat vegetables in spice mixture.",
        "Increase heat to high and bring mixture to a rolling boil (large bubbles breaking the surface), about 5-7 minutes.",
        "Once boiling, reduce heat to medium-low to maintain a gentle simmer. Cover pot with lid slightly ajar (to allow steam to escape).",
        "Simmer for 20-25 minutes, stirring every 5-7 minutes to prevent sticking, until sweet potatoes are fork-tender and lentils have broken down and thickened the curry.",
        "Shake the can of coconut milk well before opening. Pour entire can into the pot and stir to incorporate.",
        "Add 2 cups fresh spinach to the curry. Stir gently until spinach wilts completely, about 2-3 minutes.",
        "Remove pot from heat. Taste and season with salt and pepper as needed (start with 1/2 teaspoon salt and adjust).",
        "Let curry rest for 5 minutes before serving - this allows flavors to meld and curry to thicken slightly more.",
        "Serve warm over cooked basmati rice, quinoa, or with naan bread on the side.",
        "Garnish with fresh cilantro if desired."
      ],
      "tips": ["Adjust curry powder to taste - use just 1 tablespoon if sensitive to spices during pregnancy", "This freezes beautifully in portion-sized containers for quick future meals", "The coconut milk adds creaminess and healthy fats that help absorb fat-soluble vitamins"],
      "time_minutes": 45,
      "difficulty": "easy",
      "servings": 6,
      "calories": 295,
      "allergens": [],
      "storage": "Refrigerate in a airtight container for up to 4 days. Freeze in portion-sized freezer-safe containers for up to 3 months. Thaw overnight in refrigerator. Reheat on stovetop over medium heat for 5-7 minutes, stirring occasionally, until heated through to 165°F."
    },
    {
      "title": "Mediterranean Chicken and Chickpea Salad",
      "description": "A refreshing, no-cook protein-packed salad loaded with healthy fats, fiber, and essential pregnancy nutrients. Perfect for warm days when cooking feels overwhelming.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["gluten-free", "nut-free", "egg-free"],
      "kitchen_style_tags": ["quick"],
      "meal_types": ["lunch"],
      "cuisine": "mediterranean",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "rotisserie chicken, shredded", "amount": "2 cups"},
        {"item": "chickpeas, cooked or canned", "amount": "1.5 cups"},
        {"item": "cucumber, diced", "amount": "1 large"},
        {"item": "cherry tomatoes, halved", "amount": "2 cups"},
        {"item": "red onion, thinly sliced", "amount": "1/4 cup"},
        {"item": "kalamata olives, halved", "amount": "1/2 cup"},
        {"item": "feta cheese, crumbled", "amount": "1/2 cup"},
        {"item": "extra virgin olive oil", "amount": "1/4 cup"},
        {"item": "fresh lemon juice", "amount": "3 tbsp"},
        {"item": "dried oregano", "amount": "1 tsp"},
        {"item": "mixed greens", "amount": "4 cups"},
        {"item": "salt and pepper", "amount": "to taste"}
      ],
      "instructions": [
        "If using store-bought rotisserie chicken, remove and discard skin. Pull meat from bones and shred into bite-sized pieces (about 1-inch). Measure out 2 cups.",
        "If using canned chickpeas, drain in a colander and rinse under cold water for 30 seconds. Shake to remove excess water.",
        "Peel cucumber and cut in half lengthwise. Use a spoon to scrape out seeds. Dice into 1/2-inch pieces.",
        "Halve cherry tomatoes. Thinly slice red onion into half-moons. Halve kalamata olives and remove pits if needed.",
        "In a large mixing bowl, combine shredded chicken, chickpeas, diced cucumber, halved cherry tomatoes, sliced red onion, and halved olives. Toss gently to mix.",
        "In a small bowl or jar with lid, combine 1/4 cup olive oil, 3 tablespoons fresh lemon juice, 1 teaspoon dried oregano, 1/4 teaspoon salt, and 1/8 teaspoon black pepper.",
        "Whisk dressing vigorously for 15-20 seconds until emulsified and slightly thickened (or shake jar with lid for 10 seconds).",
        "Pour dressing over chicken and vegetable mixture. Toss gently but thoroughly with salad tongs or two large spoons until everything is evenly coated.",
        "Let salad marinate at room temperature for 10 minutes if time allows (this enhances flavor), or cover and refrigerate up to 2 hours.",
        "Just before serving, rinse mixed greens and spin or pat dry. Divide greens among 4 serving plates or bowls.",
        "Top each portion of greens with equal amounts of the chicken salad mixture (about 1.5 cups per serving).",
        "Sprinkle 2 tablespoons crumbled feta cheese over each salad.",
        "Serve immediately at room temperature or chilled."
      ],
      "tips": ["Use pre-cooked rotisserie chicken to save time and energy - perfect for pregnancy fatigue", "Pack salad without greens in a container for travel-friendly lunches at work", "This salad actually improves in flavor after a few hours as ingredients marinate together"],
      "time_minutes": 15,
      "difficulty": "easy",
      "servings": 4,
      "calories": 365,
      "allergens": ["milk"],
      "storage": "Refrigerate chicken salad mixture in airtight container for up to 3 days. Store dressing and greens separately. Add greens and feta just before eating for best texture and freshness."
    },
    {
      "title": "Baked Sweet Potato with Black Beans and Avocado",
      "description": "A simple, nutrient-dense meal loaded with fiber, folate, and healthy fats to support digestion and baby's development. This customizable dish requires minimal preparation and delivers maximum nutrition.",
      "feeding_types": ["pregnancyNutrition"],
      "dietary_tags": ["dairy-free", "gluten-free", "nut-free", "vegetarian", "vegan", "egg-free"],
      "kitchen_style_tags": ["quick"],
      "meal_types": ["lunch", "dinner"],
      "cuisine": "american",
      "age_range_min": 0,
      "age_range_max": 0,
      "ingredients": [
        {"item": "large sweet potatoes", "amount": "4"},
        {"item": "black beans, cooked or canned", "amount": "2 cups"},
        {"item": "ripe avocados, diced", "amount": "2"},
        {"item": "corn kernels, fresh or frozen", "amount": "1 cup"},
        {"item": "limes", "amount": "2"},
        {"item": "fresh cilantro, chopped", "amount": "1/4 cup"},
        {"item": "ground cumin", "amount": "1 tsp"},
        {"item": "olive oil", "amount": "1 tbsp"},
        {"item": "salt and pepper", "amount": "to taste"}
      ],
      "instructions": [
        "Preheat oven to 425°F (220°C). Position rack in center of oven. Line a large baking sheet with aluminum foil for easy cleanup.",
        "Scrub sweet potatoes thoroughly under running water with a vegetable brush to remove any dirt. Pat completely dry with paper towels.",
        "Using a fork, pierce each sweet potato 4-5 times all over (this allows steam to escape and prevents bursting during baking).",
        "Place sweet potatoes directly on prepared baking sheet, spacing them at least 2 inches apart.",
        "Bake for 45-50 minutes (depending on size) until sweet potatoes are very tender when squeezed with oven mitts and a knife slides through easily with no resistance.",
        "While sweet potatoes bake, prepare the bean topping: If using canned beans, drain and rinse under cold water for 30 seconds.",
        "Heat 1 tablespoon olive oil in a medium skillet over medium heat for 1 minute until shimmering.",
        "Add black beans, corn kernels, and 1 teaspoon ground cumin to the skillet. Stir well to coat everything in spices.",
        "Cook for 5-6 minutes, stirring occasionally, until beans are heated through and corn is tender (internal temperature should reach 165°F).",
        "Squeeze juice from 1 lime over the bean mixture (about 2 tablespoons). Season with 1/4 teaspoon salt and 1/8 teaspoon black pepper. Stir and taste, adjusting seasoning if needed. Remove from heat.",
        "While beans cook, dice avocados: Cut each avocado in half lengthwise around the pit. Twist halves apart. Carefully remove pit with a spoon. Score flesh in a crosshatch pattern while still in skin, then scoop out with spoon.",
        "Chop fresh cilantro. Cut remaining lime into 4 wedges.",
        "Once sweet potatoes are done, remove from oven and let cool for 2-3 minutes until safe to handle (they will be very hot).",
        "Using a sharp knife, make a lengthwise cut down the center of each potato, about 3/4 of the way through. Gently squeeze ends together to open the potato like a book.",
        "Fluff the inside of each sweet potato with a fork to create a fluffy bed for toppings.",
        "Divide black bean mixture evenly among the 4 sweet potatoes (about 1/2 cup each), spooning it generously into the center.",
        "Top each stuffed sweet potato with diced avocado (about 1/4 avocado per potato).",
        "Garnish with chopped cilantro and serve with a lime wedge on the side for squeezing over top.",
        "Serve immediately while warm."
      ],
      "tips": ["Bake sweet potatoes ahead of time on meal prep day and reheat in microwave for 3-4 minutes for even faster assembly", "Add a dollop of plain Greek yogurt or a sprinkle of pepitas (pumpkin seeds) for extra protein and nutrients", "Leftover bean mixture can be used as a taco filling or stirred into scrambled eggs"],
      "time_minutes": 55,
      "difficulty": "easy",
      "servings": 4,
      "calories": 380,
      "allergens": [],
      "storage": "Refrigerate baked sweet potatoes wrapped individually in foil for up to 5 days. Store bean topping and avocado separately in airtight containers for up to 3 days (toss avocado with lime juice to prevent browning). Reheat potato in microwave for 2-3 minutes, then add fresh toppings before serving."
    }
  ]
}
