{
"recipes": [
{
"title": "Cheesy Veggie Quinoa Toddler Bites",
"description": "These soft baked bites pack vegetables, quinoa, and cheese into toddler friendly finger shapes. Parents will like how easy they are to reheat for fast lunches and snacks.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["nut-free", "vegetarian"],
"kitchen_style_tags": ["batch", "picky"],
"meal_types": ["lunch", "snack"],
"cuisine": "american",
"age_range_min": 12,
"age_range_max": 36,
"ingredients": [
{"item": "quinoa, rinsed", "amount": "1/2 cup"},
{"item": "water", "amount": "1 cup"},
{"item": "finely grated carrot", "amount": "1/3 cup"},
{"item": "finely chopped spinach", "amount": "1/3 cup"},
{"item": "shredded mild cheddar cheese", "amount": "1/2 cup"},
{"item": "large egg", "amount": "1"},
{"item": "breadcrumbs", "amount": "1/4 cup"},
{"item": "olive oil for greasing", "amount": "1 teaspoon"}
],
"instructions": [
"Wash hands and heat oven to 375°F (190°C). Lightly grease a mini muffin pan with olive oil or use silicone liners.",
"Rinse quinoa under cool water in a fine mesh strainer until the water runs mostly clear.",
"Add quinoa and 1 cup water to a small saucepan. Bring to a boil over medium heat, then reduce heat to low, cover, and simmer for 12 to 15 minutes until the water absorbs and grains look fluffy.",
"Remove quinoa from heat and let it sit covered for 5 minutes, then fluff with a fork and cool for another 5 to 10 minutes until warm, not hot.",
"While quinoa cools, grate carrot on the fine side of a grater and chop spinach into tiny pieces so no long strings remain.",
"In a medium bowl, whisk the egg until smooth.",
"Add cooked quinoa, grated carrot, chopped spinach, shredded cheese, and breadcrumbs to the bowl with the egg.",
"Stir with a spoon until the mixture feels thick and holds together when pressed with your fingers. If the mix feels loose, add 1 tablespoon extra breadcrumbs and stir again.",
"Use a tablespoon measure to scoop the mixture into each mini muffin cup, filling about three quarters full. Press the top of each portion down firmly so there are no loose crumbs.",
"Bake at 375°F (190°C) for 15 to 18 minutes until edges look light golden and the tops feel set when pressed gently with a spoon.",
"Remove the pan from the oven and let bites cool in the pan for 5 minutes.",
"Carefully lift bites out with a small spoon and place them on a cooling rack. Cool until warm or room temperature.",
"Before serving, cut each bite into halves or quarters if your toddler still learns to chew, so pieces are roughly 1/2 inch or smaller.",
"Always test temperature on the inside of your wrist and serve bites while your toddler sits upright at the table."
],
"tips": [
"Bake a double batch and freeze extra bites for fast weeknight dinners.",
"Serve with a small side of yogurt or tomato sauce for dipping if your toddler likes dipping."
],
"time_minutes": 40,
"difficulty": "medium",
"servings": 12,
"calories": 55,
"allergens": ["milk", "eggs", "wheat"],
"storage": "Refrigerate in an airtight container for up to 3 days. Freeze on a tray, then store in a freezer bag for up to 2 months."
},
{
"title": "Soft Chicken Veggie Rice Bowl",
"description": "This bowl brings together tender chicken, rice, and vegetables in a mild, spoon ready mix. Parents will like the one pot method and how easily leftovers turn into quick lunches.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["dairy-free", "nut-free", "egg-free"],
"kitchen_style_tags": ["batch"],
"meal_types": ["lunch", "dinner"],
"cuisine": "american",
"age_range_min": 12,
"age_range_max": 36,
"ingredients": [
{"item": "boneless skinless chicken breast, trimmed", "amount": "4 ounces"},
{"item": "white rice, rinsed", "amount": "1/2 cup"},
{"item": "finely chopped carrot", "amount": "1/3 cup"},
{"item": "finely chopped broccoli florets", "amount": "1/3 cup"},
{"item": "low-sodium chicken broth or water", "amount": "1 3/4 cups"},
{"item": "olive oil", "amount": "1 teaspoon"}
],
"instructions": [
"Wash hands and all produce. Rinse rice in a fine mesh strainer until the water runs mostly clear.",
"Cut chicken into small pieces about 1/2 inch in size so they cook evenly and shred easily later.",
"Heat olive oil in a medium saucepan over medium heat for 1 minute.",
"Add chicken pieces to the pan in a single layer. Cook for 3 to 4 minutes, stirring often, until the outside looks white and no longer pink.",
"Add rice, carrot, broccoli, and broth or water to the pan and stir.",
"Bring mixture to a gentle boil over medium heat, then reduce heat to low and cover with a tight lid.",
"Simmer for 18 to 20 minutes, stirring once halfway, until rice looks tender, vegetables feel soft when pressed with a spoon, and chicken pieces reach 165°F (74°C) inside when checked with a food thermometer.",
"Remove the pan from heat and keep covered for 5 minutes so rice finishes steaming.",
"Use a fork to shred chicken pieces into tiny shreds in the pan. Break up any larger chunks so no piece is larger than 1/2 inch.",
"Stir the mixture well. If it feels too thick and dry, add 1 to 2 tablespoons of warm water and stir until it looks creamy and holds to a spoon.",
"Place a small portion in a toddler bowl and let it cool until warm or room temperature.",
"Before serving, press a spoonful between your fingers to confirm all pieces feel soft, not firm.",
"Always test the temperature on the inside of your wrist and serve while your toddler sits upright and supervised."
],
"tips": [
"Portion leftovers into small containers so you have single toddler servings ready to reheat.",
"Use frozen chopped vegetables if evenings feel busy, then adjust cooking time by 2 to 3 extra minutes if needed."
],
"time_minutes": 40,
"difficulty": "easy",
"servings": 4,
"calories": 140,
"allergens": [],
"storage": "Refrigerate in an airtight container for up to 3 days. Freeze portions in small containers for up to 2 months."
},
{
"title": "Veggie Lentil Pancakes",
"description": "These soft skillet pancakes use red lentils and vegetables for a protein rich finger food. Parents will like the make ahead batter and easy freezable leftovers.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["dairy-free", "nut-free", "egg-free", "vegetarian", "vegan"],
"kitchen_style_tags": ["batch", "picky"],
"meal_types": ["breakfast", "lunch"],
"cuisine": "indian",
"age_range_min": 12,
"age_range_max": 36,
"ingredients": [
{"item": "red lentils, rinsed", "amount": "1/2 cup"},
{"item": "water for soaking", "amount": "1 1/2 cups"},
{"item": "finely grated zucchini, squeezed dry", "amount": "1/3 cup"},
{"item": "finely grated carrot", "amount": "1/3 cup"},
{"item": "water for blending", "amount": "1/4 to 1/3 cup"},
{"item": "salt (optional, for toddlers over 12 months)", "amount": "1 small pinch"},
{"item": "oil for cooking", "amount": "2 teaspoons"}
],
"instructions": [
"Wash hands and rinse red lentils in a fine mesh strainer until the water runs mostly clear.",
"Place lentils in a bowl and cover with 1 1/2 cups water. Soak for 30 minutes at room temperature.",
"Drain soaked lentils and place them in a blender with 1/4 cup fresh water.",
"Blend on high for 45 to 60 seconds until the batter looks smooth and thick, similar to pancake batter. Add up to 1 extra tablespoon water if the blender struggles.",
"Grate zucchini and carrot on the fine side of a grater. Squeeze grated zucchini in a clean towel or paper towel to remove extra moisture.",
"Stir grated vegetables and optional salt into the lentil batter until evenly mixed.",
"Heat a nonstick skillet over medium heat for 2 to 3 minutes. Add a thin layer of oil and spread it around with a paper towel.",
"Drop batter onto the pan using a tablespoon, forming small pancakes about 2 to 2 1/2 inches wide. Keep them spaced so flipping stays easy.",
"Cook each pancake for 2 to 3 minutes until the edges look set and small bubbles appear on the surface. The bottom should look light golden when lifted with a spatula.",
"Flip with a thin spatula and cook the other side for 2 to 3 minutes until light golden and fully set in the center.",
"Transfer pancakes to a plate lined with a paper towel and let them cool to warm or room temperature.",
"Cut pancakes into strips or small squares about 1/2 inch wide for safer chewing.",
"Always test a piece between your fingers to confirm the texture feels soft and easy to squish before serving.",
"Serve while your toddler sits upright and supervised at the table."
],
"tips": [
"Keep soaked lentils in the fridge overnight if you want to blend fresh batter in the morning.",
"Serve with yogurt or tomato chutney on the side if your toddler enjoys dipping."
],
"time_minutes": 50,
"difficulty": "medium",
"servings": 10,
"calories": 45,
"allergens": [],
"storage": "Refrigerate pancakes in a sealed container for up to 3 days. Freeze in a single layer, then move to a bag for up to 2 months."
},
{
"title": "Apple Cinnamon Oat Toddler Porridge",
"description": "This warm porridge blends oats, apple, and cinnamon into a cozy breakfast bowl. Parents will like the simple ingredients and easy way to adjust thickness for different stages.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["nut-free", "vegetarian", "egg-free"],
"kitchen_style_tags": ["quick"],
"meal_types": ["breakfast"],
"cuisine": "american",
"age_range_min": 12,
"age_range_max": 48,
"ingredients": [
{"item": "rolled oats", "amount": "1/2 cup"},
{"item": "milk or fortified plant milk", "amount": "1 cup"},
{"item": "water", "amount": "1/2 cup"},
{"item": "small apple, peeled and finely grated", "amount": "1"},
{"item": "ground cinnamon", "amount": "1/4 teaspoon"}
],
"instructions": [
"Wash hands and peel the apple. Grate on the fine side of a grater so pieces stay soft in the porridge.",
"Add oats, milk, water, grated apple, and cinnamon to a small saucepan.",
"Stir and place the pan over medium heat.",
"Bring mixture to a gentle simmer while stirring often so oats do not stick to the bottom.",
"Reduce heat to low and cook for 6 to 8 minutes, stirring every minute, until the porridge looks thick and creamy and oats feel soft when pressed between your fingers.",
"If porridge looks thicker than you prefer, add 1 to 2 tablespoons extra water and stir over low heat for another minute.",
"Remove from heat and let porridge cool in the pan for 5 minutes. It will thicken slightly as it cools.",
"Spoon a toddler sized portion into a bowl and stir to release steam so the top cools faster.",
"Check texture by pressing a spoonful between your fingers. The mixture should feel smooth with soft oat pieces.",
"IMPORTANT: Test the temperature on the inside of your wrist. Serve only when the porridge feels warm or room temperature, not hot.",
"Serve in a shallow bowl and stay close while your toddler eats in an upright position."
],
"tips": [
"Reheat leftovers with a splash of milk or water and stir over low heat until smooth.",
"Top with a small spoon of nut butter for older toddlers if your pediatrician already checked for nut allergies."
],
"time_minutes": 20,
"difficulty": "easy",
"servings": 3,
"calories": 130,
"allergens": ["milk"],
"storage": "Refrigerate in a sealed container for up to 3 days. Add extra liquid when reheating, as oats thicken over time."
},
{
"title": "Salmon Potato Veggie Mash",
"description": "This fork mash meal offers soft flakes of salmon with potato and peas for healthy fats and protein. Parents will like how smooth the texture feels while still offering gentle chunks for toddlers who practice chewing.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["nut-free", "egg-free"],
"kitchen_style_tags": ["batch"],
"meal_types": ["lunch", "dinner"],
"cuisine": "mediterranean",
"age_range_min": 12,
"age_range_max": 48,
"ingredients": [
{"item": "boneless skinless salmon fillet", "amount": "4 ounces"},
{"item": "medium potato, peeled and chopped into 1 inch cubes", "amount": "1"},
{"item": "frozen peas", "amount": "1/3 cup"},
{"item": "unsalted butter", "amount": "1 tablespoon"},
{"item": "milk or plant milk", "amount": "2 to 3 tablespoons"},
{"item": "water for boiling", "amount": "as needed"}
],
"instructions": [
"Wash hands and peel the potato. Cut into 1 inch cubes so they cook evenly.",
"Place potato cubes in a medium saucepan and cover with cold water by about 1 inch.",
"Bring to a boil over medium high heat, then reduce heat to medium and simmer for 12 to 15 minutes until potatoes feel soft when pierced with a fork.",
"Add frozen peas during the last 3 minutes of potato cooking. Peas should look bright green and soft.",
"Drain potatoes and peas in a colander and set aside.",
"While potatoes cook, heat oven to 375°F (190°C). Line a small baking dish with parchment paper.",
"Place salmon fillet in the dish. Bake for 12 to 15 minutes until the thickest part reaches 145°F (63°C) and flakes easily with a fork. The flesh should look opaque, not translucent.",
"Let salmon cool for 5 minutes, then use a fork to break it into small flakes. Remove any bones you see by hand.",
"Return potatoes and peas to the warm saucepan. Add butter and 2 tablespoons milk.",
"Mash with a potato masher or fork until smooth with a few soft lumps.",
"Add flaked salmon and stir until well mixed. If mixture feels too thick, add up to 1 extra tablespoon milk and stir again.",
"For younger toddlers, mash more so pieces are smaller than 1/2 inch. For older toddlers, leave slightly larger soft flakes.",
"Transfer a small portion to a toddler bowl and let it cool to warm or room temperature.",
"Always test temperature on the inside of your wrist and check texture with your fingers before serving while your toddler sits upright."
],
"tips": [
"Bake extra salmon, flake it, and store in the fridge to stir into other grain or pasta dishes.",
"Serve leftovers in small patties the next day by pan warming spoonfuls in a nonstick pan."
],
"time_minutes": 40,
"difficulty": "medium",
"servings": 4,
"calories": 170,
"allergens": ["milk", "fish"],
"storage": "Refrigerate in a sealed container for up to 2 days. Do not freeze fish and potato mash for toddlers, as texture changes after thawing."
},
{
"title": "Deconstructed Soft Taco Toddler Bowl",
"description": "This Mexican style bowl uses soft sweet potato, black beans, and small tortilla strips for a finger friendly meal. Parents will like the flexible toppings that work for different ages at the table.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["nut-free", "vegetarian", "egg-free"],
"kitchen_style_tags": ["batch", "picky"],
"meal_types": ["lunch", "dinner"],
"cuisine": "mexican",
"age_range_min": 18,
"age_range_max": 48,
"ingredients": [
{"item": "sweet potato, peeled and cut into 1 inch cubes", "amount": "1 cup"},
{"item": "cooked low-sodium black beans, rinsed", "amount": "1/2 cup"},
{"item": "small soft flour or corn tortilla", "amount": "1"},
{"item": "mild shredded cheese", "amount": "1/4 cup"},
{"item": "water", "amount": "1 cup"},
{"item": "olive oil", "amount": "1 teaspoon"}
],
"instructions": [
"Wash hands and peel sweet potato. Cut into 1 inch cubes.",
"Place sweet potato cubes in a small saucepan and add 1 cup water.",
"Bring to a boil over medium heat, then reduce heat to low and simmer for 10 to 12 minutes until cubes feel very soft when pierced with a fork.",
"Drain sweet potatoes and place them in a bowl. Mash with a fork until smooth, adding a spoon of cooking liquid if you saved some and the mash feels dry.",
"Warm black beans in a small saucepan over low heat for 3 to 4 minutes with 1 to 2 tablespoons water. Beans should feel soft and hot but not boiling.",
"Lightly mash beans with a fork so skins break and texture feels soft for toddlers.",
"Heat a nonstick skillet over medium heat with 1 teaspoon olive oil.",
"Place tortilla in the pan and warm for 30 to 60 seconds on each side until soft and flexible, with light golden spots.",
"Remove tortilla and cut into short strips about 1/2 inch wide and 1 inch long. For younger toddlers, cut strips into smaller squares.",
"To serve, place a small scoop of sweet potato mash, mashed beans, tortilla pieces, and shredded cheese in a toddler bowl, keeping each part in a small section.",
"Let everything cool until warm or room temperature. Cheese will soften over the warm ingredients.",
"Before serving, press each component between your fingers to confirm texture feels soft and easy to squish.",
"Always seat your toddler upright and offer small pieces, watching closely while they eat."
],
"tips": [
"Serve plain sweet potato mash for toddlers who feel unsure about beans, then add small spoonfuls of beans over time.",
"Use extra tortillas to make strips for dipping into mashed sweet potato on busy nights."
],
"time_minutes": 30,
"difficulty": "easy",
"servings": 3,
"calories": 160,
"allergens": ["milk", "wheat"],
"storage": "Refrigerate sweet potato mash and beans in separate sealed containers for up to 3 days. Store tortilla strips in a sealed bag at room temperature for 1 day."
},
{
"title": "Soft Tofu Veggie Stir Fry with Rice",
"description": "This Asian inspired plate offers soft tofu cubes with finely chopped vegetables over rice. Parents will like the gentle flavors and simple sauce that stays mild for toddlers.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["dairy-free", "nut-free", "vegetarian", "vegan", "egg-free"],
"kitchen_style_tags": ["batch"],
"meal_types": ["lunch", "dinner"],
"cuisine": "asian",
"age_range_min": 12,
"age_range_max": 36,
"ingredients": [
{"item": "firm tofu, drained", "amount": "1/2 block (about 7 ounces)"},
{"item": "cooked white rice, warm", "amount": "1 1/2 cups"},
{"item": "finely chopped carrot", "amount": "1/4 cup"},
{"item": "finely chopped green beans", "amount": "1/4 cup"},
{"item": "finely chopped bell pepper, no skin pieces larger than 1/4 inch", "amount": "1/4 cup"},
{"item": "low-sodium soy sauce", "amount": "1 teaspoon"},
{"item": "water", "amount": "2 tablespoons"},
{"item": "sesame oil or neutral oil", "amount": "2 teaspoons"}
],
"instructions": [
"Wash hands and prepare cooked rice ahead of time so it stays warm but not hot.",
"Pat tofu dry with a paper towel and cut into small cubes about 1/2 inch in size.",
"Heat 1 teaspoon oil in a medium nonstick skillet over medium heat.",
"Add tofu cubes in a single layer and cook for 2 to 3 minutes on each side until light golden, turning with a spatula. Tofu should stay soft inside.",
"Remove tofu to a plate.",
"Add remaining 1 teaspoon oil to the skillet and keep heat at medium.",
"Add chopped carrot, green beans, and bell pepper. Cook for 4 to 5 minutes while stirring often until vegetables feel soft when pressed with a spoon.",
"Stir soy sauce and 2 tablespoons water in a small bowl.",
"Return tofu to the pan, pour the soy sauce mixture over, and stir.",
"Cook for 1 to 2 minutes more until everything looks coated and sauce lightly bubbles.",
"Remove pan from heat and let mixture cool for 5 minutes.",
"Place warm rice in a toddler bowl and top with tofu and vegetables. Stir lightly so sauce spreads through the rice.",
"Check that no piece is larger than 1/2 inch. Cut bigger pieces if needed.",
"Always test temperature on the inside of your wrist and serve while your toddler sits upright and supervised."
],
"tips": [
"Use leftover rice from family dinner to speed up this meal the next day.",
"Mash some tofu and rice together with a fork for toddlers who still prefer softer textures."
],
"time_minutes": 25,
"difficulty": "easy",
"servings": 4,
"calories": 160,
"allergens": ["soy", "wheat"],
"storage": "Refrigerate tofu and vegetables in a sealed container for up to 3 days. Store rice separately and reheat with a splash of water before serving."
},
{
"title": "Turkey Veggie Mini Meatballs with Pasta",
"description": "These mini meatballs combine ground turkey and vegetables in a tender texture with small pasta. Parents will like serving the same meal to the whole family while cutting pieces safely for toddlers.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["nut-free"],
"kitchen_style_tags": ["batch", "picky"],
"meal_types": ["lunch", "dinner"],
"cuisine": "italian",
"age_range_min": 18,
"age_range_max": 48,
"ingredients": [
{"item": "lean ground turkey", "amount": "8 ounces"},
{"item": "finely grated zucchini, squeezed dry", "amount": "1/3 cup"},
{"item": "finely grated carrot", "amount": "1/4 cup"},
{"item": "breadcrumbs", "amount": "1/4 cup"},
{"item": "grated Parmesan cheese", "amount": "2 tablespoons"},
{"item": "large egg", "amount": "1"},
{"item": "small pasta shapes such as elbows or shells", "amount": "1 cup"},
{"item": "no-salt tomato sauce", "amount": "1 cup"},
{"item": "water for boiling pasta", "amount": "as needed"},
{"item": "olive oil for greasing", "amount": "1 teaspoon"}
],
"instructions": [
"Wash hands and heat oven to 375°F (190°C). Line a baking sheet with parchment paper and brush with a thin layer of olive oil.",
"Grate zucchini and carrot on the fine side of a grater. Squeeze zucchini in a clean towel to remove extra moisture.",
"In a medium bowl, beat the egg with a fork.",
"Add ground turkey, grated vegetables, breadcrumbs, Parmesan, and egg to the bowl.",
"Mix with clean hands until ingredients look evenly combined and the mixture feels sticky but holds together.",
"Scoop mixture using a teaspoon and roll into small meatballs about 1 inch wide. Place them on the lined baking sheet with a little space between each.",
"Bake for 15 to 18 minutes until meatballs look light brown on the outside and reach an internal temperature of 165°F (74°C) when checked with a food thermometer.",
"While meatballs bake, bring a medium pot of water to a boil over high heat.",
"Add pasta to the boiling water and cook according to package instructions, usually 7 to 10 minutes, until pasta feels soft when pressed between your fingers.",
"Drain pasta and return to the pot. Add tomato sauce and stir over low heat for 2 to 3 minutes until warmed through.",
"Transfer baked meatballs to a clean plate and rest for 5 minutes.",
"For toddlers, cut each meatball into quarters or smaller pieces so no piece is larger than 1/2 inch.",
"Serve small spoonfuls of pasta in sauce with cut meatball pieces on top. Stir gently so sauce coats everything.",
"Check temperature on the inside of your wrist and confirm all pieces feel soft before serving while your toddler sits upright."
],
"tips": [
"Freeze half the baked meatballs for a future quick pasta night.",
"Serve meatball pieces alone with sauce on the side if your toddler prefers to dip."
],
"time_minutes": 45,
"difficulty": "medium",
"servings": 5,
"calories": 220,
"allergens": ["milk", "eggs", "wheat"],
"storage": "Refrigerate meatballs and pasta in separate sealed containers for up to 3 days. Freeze cooked meatballs for up to 2 months."
},
{
"title": "Creamy Hummus Yogurt Veggie Dippers",
"description": "This snack pairs a smooth hummus yogurt dip with soft veggie sticks for a fun finger food plate. Parents will like the quick stir together dip and easy way to offer vegetables.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["nut-free", "vegetarian", "egg-free"],
"kitchen_style_tags": ["quick", "picky"],
"meal_types": ["snack", "lunch"],
"cuisine": "mediterranean",
"age_range_min": 18,
"age_range_max": 48,
"ingredients": [
{"item": "plain hummus", "amount": "1/4 cup"},
{"item": "plain whole milk yogurt", "amount": "1/4 cup"},
{"item": "steamed carrot sticks, 1/4 inch thick and 2 inches long", "amount": "1/2 cup"},
{"item": "steamed broccoli florets, cut into small trees", "amount": "1/2 cup"},
{"item": "water", "amount": "1 to 2 tablespoons"}
],
"instructions": [
"Wash hands and wash vegetables well under cool water.",
"Cut carrots into sticks about 1/4 inch thick and 2 inches long.",
"Place carrot sticks and small broccoli florets in a steamer basket over a pot with 1 inch of simmering water.",
"Cover and steam over medium heat for 6 to 8 minutes until vegetables feel soft when pressed between your fingers but still hold their shape.",
"Remove vegetables from the steamer and spread on a plate to cool to warm or room temperature.",
"In a small bowl, stir hummus and yogurt together until the mixture looks smooth and light.",
"If the dip feels too thick for easy scooping, stir in 1 tablespoon water and check again. Add a second tablespoon only if needed.",
"Spoon dip into a shallow toddler bowl or sectioned plate.",
"Arrange cooled carrot sticks and broccoli pieces around the dip.",
"Before serving, press each vegetable piece between your fingers to confirm the texture feels soft and easy to squish.",
"Serve while your toddler sits upright and show small dipping motions to guide safe eating.",
"Remove any pieces that fall to the floor to keep the eating area safe and clean."
],
"tips": [
"Steam extra vegetable sticks and keep them in the fridge so snacks come together fast.",
"Swap in soft pita strips for older toddlers who manage mixed textures well."
],
"time_minutes": 20,
"difficulty": "easy",
"servings": 3,
"calories": 110,
"allergens": ["milk", "sesame"],
"storage": "Refrigerate dip in a sealed container for up to 2 days. Store steamed vegetables in a separate container for up to 2 days."
},
{
"title": "Banana Peanut Butter Chia Pudding",
"description": "This pudding blends banana, yogurt, chia seeds, and peanut butter for a creamy snack or breakfast. Parents will like the no cook method and the way it sits in the fridge ready for busy mornings.",
"feeding_types": ["toddlerMeals"],
"dietary_tags": ["gluten-free", "vegetarian"],
"kitchen_style_tags": ["batch"],
"meal_types": ["breakfast", "snack"],
"cuisine": "american",
"age_range_min": 18,
"age_range_max": 48,
"ingredients": [
{"item": "ripe banana, peeled", "amount": "1 medium"},
{"item": "plain whole milk yogurt", "amount": "1 cup"},
{"item": "smooth peanut butter", "amount": "2 tablespoons"},
{"item": "chia seeds", "amount": "2 tablespoons"},
{"item": "milk or plant milk", "amount": "1/4 cup"}
],
"instructions": [
"Wash hands and peel the banana.",
"Place banana, yogurt, peanut butter, and milk in a blender.",
"Blend on high for 30 to 45 seconds until the mixture looks smooth and creamy with no banana pieces.",
"Pour the mixture into a medium bowl.",
"Stir in chia seeds with a spoon until they appear evenly spread and no dry clumps remain.",
"Cover the bowl and place it in the refrigerator for at least 2 hours, or overnight, so chia seeds swell and the mixture thickens to a pudding texture.",
"Before serving, stir the pudding again to break up any thicker sections.",
"Spoon a toddler portion into a small bowl.",
"For newer eaters, add a small splash of milk if the texture feels too thick and stir until it looks smooth and drops slowly from a spoon.",
"Always test temperature on the inside of your wrist and serve pudding cool, not frozen.",
"Seat toddler upright and offer small spoonfuls, watching for comfortable swallowing."
],
"tips": [
"Prepare this pudding in the evening so breakfast is ready in the fridge.",
"Serve with thin banana slices on top for older toddlers who handle soft pieces with confidence."
],
"time_minutes": 15,
"difficulty": "easy",
"servings": 4,
"calories": 150,
"allergens": ["milk", "peanuts"],
"storage": "Refrigerate in a sealed container for up to 3 days. Stir well each time before serving to toddlers."
}
]
}
